// Постоји N пчела и један гладан медвед. Они користе
// заједничку кошницу. Кошница је иницијално
// празна, а може да прими H напрстака меда.
// Медвед спава док се кошница не напуни медом,
// када се напуни медом, он поједе сав мед након
// чега се враћа на спавање. Пчелице непрестано
// лете од цвета до цвета и сакупљају мед. Када
// прикупе један напрстак долазе и стављају га у
// кошницу. Она пчела која је попунила кошницу
// буди медведа. Користећи семафоре решити
// проблем.

const int H = ...;
int hive = 0;
sem mutex = 1, empty = 0, full = 0;
void bee(){
  mutex.wait();
  hive++;
  if(hive == H){
    full.signal();
    // empty.wait(); // ne mora da ceka da se pojede 
  }
  else mutex.signal();
}

void bear(){
  full.wait();
  hive = 0;
  // empty.signal();
  mutex.signal();

}