// У систему се извршавају три процеса F, G и H, при чему сваки
// процес има локални низ целих бројева. Сваки од низова је уређен
// неопадајуће. Најмање један исти број се појављује у сваком од ова три низа.
// Написати код за сваки од ова три процеса у којем три процеса међусобно
// комуницирају док сваки од њих не одреди најмању заједничку вредност.
// Поруке које се размењују могу да садрже само по један елемент низа.
// Користити синхрону размену порука

const int N = ...;
// 1, 4, [7], 10 
// 0, [7], 10, 11 
// 0, 1, 2, 3, [7] 
chan f(int), g(int), h(int);
void F(){
  int arr[N] = ...; // 1, 4, [7], 10 ... nek bude 7 najmanji zaj broj
  int val = 0, i = 0;

  send g(arr[i]);
  while(true){
    recieve f(val);

    while(val > arr[i])i++;

    send h(arr[i]);
  }

}

void G(){
  int arr[N] = ...; // 0, [7], 10, 11 
  int val, i = 0;

  while(true){
    recieve f(val);

    while(val > arr[i])i++;

    send h(arr[i]);
  }
}

