// Негде у Африци постоји дубок кањон на чијим литицама живе два
// чопора бабуна (The Baboons Crossing Problem). Између две литице кањона
// постоји хоризонтална лијана преко које бабуни прелазе реку, потенцијално се
// мимоилазећи. Да би се избегао сукоб између бабуна у једном тренутку на
// лијани смеју да се нађу само бабуни који припадају истом чопору. Такође,
// лијана може да издржи највише 5 бабуна, иначе пуца. Обезбедити да се мења
// чопор које користи лијану најкасније након што пређе 10 бабуна који
// припадају истом чопору, ако су за то време један или више бабуна који
// припадају другом чопору чекали да пређу реку. Користећи C-Lindu написати
// програм који решава овај проблем.


const int MAX = 5;

void baboon1(){

  while(1){
    
    if(inp("turn", 0))out("turn", 1);
    out("bw1");
    rd("turn", 1); // wait for our turn

    
    in("slot");
    // cross
    out("slot");
    in("bw1");
    if(rdp("bw2"))



  }

}

void init(){
  for(...)eval(baboon1());
  for(...)eval(baboon2());
  for(int i = 0; i<MAX; i++)out("slot"); // 5 slots


}